package algorithm.tree;

/**
 * 基本的树的算法
 *
 * @author xiaoqi.zyq@alibaba-inc.com
 * @date 2020/01/02
 */
public class BasicArithmetic {

    //====================遍历======================
    //前序遍历递归
    //前序遍历非递归
    //中序遍历递归
    //中序遍历非递归
    //后续遍历递归
    //后续遍历非递归
    //层序遍历递归
    //层序遍历非递归

    //===================二分搜索树====================

    //===================红黑树===================

    //===================平衡树===================

    //===================哈夫曼树===================


}
